{
  "backend/main.mo": "Motoko actor managing user profiles and versioned Valentine snapshots with access control, write‑token checks, and blob‑storage integration.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs for tracking UI and video‑page requirements.",
  "frontend-file-summaries.txt": "Aggregated list of short summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base/theme definitions using OKLCH colors with light/dark variants and global styling tokens.",
  "frontend/index.html": "Base HTML template loading the root React app via main.tsx.",
  "frontend/public/demos/three-remote-videos.html": "Standalone demo page showing responsive grid loading of three remote videos with lazy loading and error handling.",
  "frontend/REMOTE_VIDEO_SAVE_SPEC.md": "Technical spec detailing the remote video save architecture, data flow, error handling, and backend–frontend responsibilities.",
  "frontend/src/App.tsx": "Main app component managing pages, user input state, save/restore logic, and remote snapshot polling.",
  "frontend/src/components/FloatingHearts.tsx": "Renders animated floating heart icons positioned around the screen.",
  "frontend/src/components/SaveProgressButton.tsx": "Save button with login handling, popover options, share link copying, and status display.",
  "frontend/src/components/StepNavigation.tsx": "Provides navigation controls between the landing, videos, and final steps.",
  "frontend/src/components/ValentineLayout.tsx": "Wraps pages in a themed layout with optional floating hearts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing identity loading, login, and state exposure.",
  "frontend/src/hooks/useValentineSnapshotPolling.ts": "Polls remote snapshot versions and flags when a newer version is available without overwriting local edits.",
  "frontend/src/index.css": "Tailwind setup defining light/dark romantic color palettes, utility classes, glass/gradient styles, and floating heart animations.",
  "frontend/src/lib/saveId.ts": "Helpers to read, write, remove, and generate shareable links for saveId in the browser URL.",
  "frontend/src/lib/valentineProgressStorage.ts": "Local progress persistence using localStorage for text and IndexedDB for video blobs, with save/load and cleanup utilities.",
  "frontend/src/lib/valentineRemoteProgress.ts": "Remote snapshot client handling validation, encoding, tokens, error normalization, and communication with the backend.",
  "frontend/src/main.tsx": "App entry wrapping React app with query client and Internet Identity provider before rendering.",
  "frontend/src/pages/FinalMessagePage.tsx": "Page for editing the final message with a textarea and button to return to start.",
  "frontend/src/pages/LandingPage.tsx": "Landing page to input the initial Valentine message and proceed to video setup.",
  "frontend/src/pages/VideosPage.tsx": "Page to preview videos, edit their titles, and navigate to the final message step.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing) and persist them in sessionStorage, plus utilities for clearing stored or hash parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended fonts, colors, border radii, and includes animation and typography plugins.",
  "project_state.json": "Describes project requirements, architecture notes, existing features, and known issues for a 3‑page Valentine’s website with real-time cloud-backed persistence."
}