{
  "backend/main.mo": "Motoko actor managing user profiles and valentine snapshots with versioning, write‑token auth, and blob‑storage support.",
  "feature_evidence.json": "Feature evidence report linking a spec file to components, tests, and feature metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for quick reference.",
  "frontend/index.css": "Tailwind base/theme variables defining light/dark romantic color palettes and global styles.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/REMOTE_VIDEO_SAVE_SPEC.md": "Markdown spec detailing the remote video save architecture, error handling, security, and test plan.",
  "frontend/src/App.tsx": "Main React app orchestrating pages, remote/local save-restore, authentication, polling, and video state.",
  "frontend/src/components/FloatingHearts.tsx": "Renders decorative floating heart icons with staggered animations.",
  "frontend/src/components/SaveProgressButton.tsx": "Save button with login handling, save modes, progress display, share links, and error UI.",
  "frontend/src/hooks/useActor.ts": "Manages creation and caching of a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout methods, and identity loading via an auth client.",
  "frontend/src/hooks/useValentineSnapshotPolling.ts": "Polls the backend for newer Valentine snapshot versions and notifies when updates exist without overwriting local edits.",
  "frontend/src/index.css": "Defines Tailwind layers and a pink/red themed light/dark palette with custom animations and utility classes.",
  "frontend/src/lib/saveId.ts": "Utilities for reading, writing, and removing the saveId parameter in URLs and generating shareable links.",
  "frontend/src/lib/valentineProgressStorage.ts": "Handles saving and loading Valentine progress using localStorage for text and IndexedDB for video blobs.",
  "frontend/src/lib/valentineRemoteProgress.ts": "Implements backend interactions for Valentine snapshots including validation, encoding, conflict handling, and write token management.",
  "frontend/src/main.tsx": "Application entry that sets up React Query, Internet Identity provider, global styles, and renders the App component.",
  "frontend/src/pages/FinalMessagePage.tsx": "Renders the final message page with an editable textarea, animated hearts, and a styled preview of the final message.",
  "frontend/src/pages/LandingPage.tsx": "Displays the landing page with a customizable message input, decorative hearts, and a button to navigate to the next page.",
  "frontend/src/pages/VideosPage.tsx": "Provides three video upload slots with editable headings, preview handling, and navigation to the next page.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the project.",
  "project_state.json": "Describes project state, requirements, architecture notes, issues, and features for the Valentine’s Day website."
}