{
  "backend/main.mo": "Motoko actor handling Valentine snapshots, user profiles, and access control with versioning and write‑token authorization.",
  "feature_evidence.json": "Feature evidence report listing frontend changes, required defaults, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for major frontend source files used for build planning.",
  "frontend/index.css": "Tailwind‑based global styles defining color variables, theming, and base layout rules for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/public/demos/three-remote-videos.html": "Standalone demo page showing three remotely loaded videos with responsive layout, lazy loading, and error handling.",
  "frontend/REMOTE_VIDEO_SAVE_SPEC.md": "Technical spec detailing the remote video save architecture, data flow, error handling, and backend/ frontend integration.",
  "frontend/src/App.tsx": "Main app component managing page navigation, user state, save/restore logic, and remote snapshot handling.",
  "frontend/src/components/FloatingHearts.tsx": "Renders animated floating heart decorations positioned across the screen.",
  "frontend/src/components/SaveProgressButton.tsx": "Save button with popover showing save options, login handling, shareable link copying, and status display.",
  "frontend/src/components/StepNavigation.tsx": "Provides step-based navigation between landing, videos, and final pages with forward/back controls.",
  "frontend/src/components/ValentineLayout.tsx": "Layout wrapper applying background styling and optional floating hearts around page content.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hook managing Internet Identity login, stored identities, and auth state.",
  "frontend/src/hooks/useValentineSnapshotPolling.ts": "Polling hook that checks for remote snapshot updates and notifies when a newer version exists.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme color variables, custom utilities, and animations for floating hearts.",
  "frontend/src/lib/saveId.ts": "Helpers for reading, writing, and removing a saveId query parameter and constructing shareable links.",
  "frontend/src/lib/valentineProgressStorage.ts": "Manages saving and loading Valentine progress using localStorage for text and IndexedDB for video blobs.",
  "frontend/src/lib/valentineRemoteProgress.ts": "Implements remote snapshot saving/loading with validation, error handling, token storage, and video metadata encoding.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity, and global CSS.",
  "frontend/src/pages/FinalMessagePage.tsx": "UI page for entering the final Valentine's message with a form and navigation button.",
  "frontend/src/pages/LandingPage.tsx": "Landing page for writing the initial Valentine's message and proceeding to the video step.",
  "frontend/src/pages/VideosPage.tsx": "Page for editing video titles and previewing uploaded videos before moving to the final message.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), storing/retrieving them in sessionStorage, and persisting values across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, colors, radii, dark mode, content paths, and animation/typography plugins.",
  "project_state.json": "Defines the project’s current state, architecture notes, existing features, and known issues for a multi-page Valentine’s site with real‑time cloud persistence."
}