{
  "kind": "build_request",
  "title": "Mirror reference webpage styling and polish the featured videos section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Mirror the design and layout of the reference webpage at https://apshara-wes.caffeine.xyz/#caffeineAdminToken=82696d0f77374658286ae9585e99fd26e1acce8a0386456642a7084c58cb7d7b across the 3-page Valentine site by aligning color usage, typography, spacing, and component styling to match the reference as closely as possible without copying copyrighted assets verbatim.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Your task is to create a new website that mirrors the design and layout of the provided webpage."
        ]
      },
      "acceptanceCriteria": [
        "Landing, Videos, and Final Message pages present a cohesive visual system that matches the reference page’s overall layout and styling (colors, spacing, typographic scale, component shapes)",
        "No third-party/copyrighted images, icons, or proprietary brand marks from the reference are copied directly into the new site",
        "All user-facing text remains in English"
      ]
    },
    {
      "id": "REQ-37",
      "text": "Update the Videos page section header and surrounding copy to reflect a clear ‘Featured Videos’ section while continuing to prominently embed the three provided MP4 URLs as the only video sources.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Example of how the video section might be structured:  - Video Section Title: \"Featured Videos\"",
          "The video section of the new website should prominently feature the three provided video URLs."
        ]
      },
      "acceptanceCriteria": [
        "Videos page displays the section title exactly as: “Featured Videos”",
        "The three embedded videos use these exact URLs as sources: https://image2url.com/r2/default/videos/1771095915401-63c93159-e8fd-4bbb-b597-ec2f0c851aae.mp4, https://image2url.com/r2/default/videos/1771096125343-9f368017-cf72-4a89-a32a-82afbda31671.mp4, https://image2url.com/r2/default/videos/1771096462549-283a08bb-3e21-4aed-bedc-66811ea1f837.mp4",
        "No UI is present that allows local video file uploads or replacing the provided URLs"
      ]
    },
    {
      "id": "REQ-38",
      "text": "Ensure the overall site experience is responsive and intuitive across mobile, tablet, and desktop, including navigation between Landing → Videos → Final Message and a video grid/layout that adapts cleanly to different screen sizes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Ensure that the website is responsive and compatible with various devices. Pay attention to the user experience, making navigation seamless and intuitive."
        ]
      },
      "acceptanceCriteria": [
        "On small screens, videos are displayed in a single-column layout with readable headings and comfortable spacing",
        "On larger screens, the videos use a multi-column/grid layout without overflow or clipped controls",
        "Primary navigation controls remain easy to discover and activate on touch devices (no overlapping fixed elements blocking actions)",
        "Videos remain playable with visible controls on Chrome, Firefox, Safari, and Edge"
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui). Compose existing UI components instead.",
    "Use English for any user-facing text.",
    "Do not introduce third-party libraries outside the existing stack (React + TypeScript, Tailwind, shadcn, React Query).",
    "Do not copy proprietary/copyrighted assets from the reference webpage; only recreate the look-and-feel using original styling and standard components.",
    "Keep the three provided MP4 URLs exactly as provided; do not alter or proxy them through the backend."
  ],
  "nonGoals": [
    "Reintroducing local video upload functionality on the Videos page",
    "Adding new backend persistence APIs or changing Motoko data models for this request",
    "Implementing new authentication providers beyond Internet Identity",
    "Pixel-perfect duplication of any copyrighted graphics or branding from the reference site"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}