{
  "kind": "build_request",
  "title": "Update App.tsx initial in-memory Valentine content (landing message, video headings, final message)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "In `frontend/src/App.tsx`, replace the current implementation of the component’s initial in-memory content with the user-provided “New Code” values, specifically updating only the default state initializers while keeping all existing save/restore, polling, navigation, and UI wiring intact.\n\nRequired default values:\n- `landingMessage` default: `\"Happy Valentine's Day, Apshara!\"`\n- `videoSlots` defaults (keep the same remote MP4 URLs, `file: null`, but change headings):\n  1) heading: `\"🤭\"`, url: `https://image2url.com/r2/default/videos/1771095915401-63c93159-e8fd-4bbb-b597-ec2f0c851aae.mp4`\n  2) heading: `\"🤐\"`, url: `https://image2url.com/r2/default/videos/1771096125343-9f368017-cf72-4a89-a32a-82afbda31671.mp4`\n  3) heading: `\"Am I in Love with You? Definitely\"`, url: `https://image2url.com/r2/default/videos/1771096462549-283a08bb-3e21-4aed-bedc-66811ea1f837.mp4`\n- `finalMessage` default: set exactly to the provided multiline text:\n  `\"Happy Valentine’s Day, Flora. I’ve been feeling terrible about last night, and I’m so sorry for how I acted. You deserve to be treated with nothing but love, especially today. I’m incredibly lucky to have you, and I’d love to make it up to you and focus on us. I love you\\nthis alr?\\n\"`\n\nDo not change any other user-facing text in the app outside these defaults.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Your task is to modify the code in the App.tsx file by replacing the current implementation with the following code snippet ... (New Code)"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load with no remote saveId in the URL and no existing local saved progress, the Landing page text field is pre-filled with \"Happy Valentine's Day, Apshara!\".",
        "On a fresh load with no remote saveId in the URL and no existing local saved progress, the Videos page shows the three existing remote MP4 videos and their headings are exactly 🤭, 🤐, and \"Am I in Love with You? Definitely\" (in that order).",
        "On a fresh load with no remote saveId in the URL and no existing local saved progress, the Final Message page textarea is pre-filled with the provided final message text including the line breaks at the end.",
        "Existing remote restore (saveId-based), global-latest restore, and local fallback restore behaviors continue to work unchanged (i.e., saved content overrides these defaults when present)."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Add brief inline comments in `frontend/src/App.tsx` adjacent to the modified state initializers explaining that these values are the initial defaults used only when no remote/global/local saved state is available, so future refactors do not accidentally treat them as hard-coded overrides.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The output should be structured as a clear, well-commented code block, ensuring that the changes made are easily understandable. Additionally, include a brief explanation of the modifications and the reasons behind them."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` contains short, clear comments near `landingMessage`, `videoSlots`, and `finalMessage` initializers indicating they are fallback defaults before restore/hydration.",
        "No new functionality is introduced; comments do not change runtime behavior."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Keep the existing save/restore, polling, and navigation logic intact; only update initial default state values and add clarifying comments."
  ],
  "nonGoals": [
    "Do not redesign UI styling, layout, or navigation behavior.",
    "Do not change backend APIs, Motoko canister logic, or remote save/restore protocol.",
    "Do not modify the three remote MP4 URLs or reintroduce local video upload behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}