{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update App.tsx fallback default Valentine content and document restore precedence",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Update App.tsx initial in-memory default state values for landing message, video headings (keeping URLs), and final message without changing save/restore, polling, navigation, or other UI text.",
      "acceptanceCriteria": [
        "On a fresh load with no remote saveId in the URL and no existing local saved progress, the Landing page text field is pre-filled with \"Happy Valentine's Day, Apshara!\".",
        "On a fresh load with no remote saveId in the URL and no existing local saved progress, the Videos page shows the three existing remote MP4 videos and their headings are exactly 🤭, 🤐, and \"Am I in Love with You? Definitely\" (in that order).",
        "On a fresh load with no remote saveId in the URL and no existing local saved progress, the Final Message page textarea is pre-filled with the provided final message text including the line breaks at the end.",
        "Existing remote restore (saveId-based), global-latest restore, and local fallback restore behaviors continue to work unchanged (i.e., saved content overrides these defaults when present)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Change ONLY the useState default initializers for landingMessage, videoSlots headings (keep file: null and the exact existing remote MP4 URLs), and finalMessage to match the required provided defaults; ensure no other user-facing text or existing save/restore, polling, navigation, and UI wiring is altered."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Add brief inline comments near the modified App.tsx state initializers clarifying they are fallback defaults used only before restore/hydration.",
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` contains short, clear comments near `landingMessage`, `videoSlots`, and `finalMessage` initializers indicating they are fallback defaults before restore/hydration.",
        "No new functionality is introduced; comments do not change runtime behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add concise inline comments adjacent to the landingMessage, videoSlots, and finalMessage initializers noting these values are initial fallback defaults used only when no remote saveId restore, global-latest restore, or local saved progress is available; do not introduce any behavior changes."
        }
      ]
    }
  ]
}