{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remote video save reliability: frontend snapshot API compatibility, blob persistence restore, and actionable errors",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Fix \"Save failed\" by aligning the frontend remote-save client with the deployed Valentine snapshot API surface and preventing runtime method/type mismatches during create/update flows (including video blob payloads).",
      "acceptanceCriteria": [
        "With Internet Identity signed in, clicking the Save button successfully creates a remote save (no \"save failed\" message).",
        "When a saveId already exists, clicking Save successfully updates the existing remote save (no \"save failed\" message).",
        "The frontend no longer hits runtime failures related to missing backend methods (e.g., \"... is not a function\") during save/restore.",
        "The remote-save client (`frontend/src/lib/valentineRemoteProgress.ts`) can call the backend methods without type/interface mismatches at runtime."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/valentineRemoteProgress.ts",
          "operation": "modify",
          "description": "Audit and update the remote-save client to match the declared backend actor interface (create/update/get/version/global-latest) and harden runtime guards so missing methods and actor unavailability produce clear English errors instead of runtime crashes. Use the blob-storage ExternalBlob semantics consistently for snapshot payloads (create/update) and restores. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Ensure the actor initialization/refresh behavior used by the save/restore flows is robust against identity changes and transient null actors (e.g., avoid stale actors across login/logout) so save calls do not fail due to actor lifecycle issues. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update save/create/update orchestration to rely on the hardened remote-save client behavior, avoid throwing generic errors, and ensure UI state transitions (saving/saved/error) reflect real backend call outcomes without hitting \"... is not a function\" failures. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Ensure remote-saved videos restore correctly from backend snapshot blob data (saveId-based share link) with correct reconstruction of all three video slots, independent of original uploader session blob URLs.",
      "acceptanceCriteria": [
        "After saving with at least one uploaded video, opening the app in a fresh browser profile/device using the generated shareable link restores the landing message, final message, the three video headings, and playable video previews for any saved videos.",
        "Restored video previews do not rely on local `blob:` URLs from the original uploader session; restored videos are reconstructed from the backend snapshot blob data.",
        "If no videos were saved, restore still succeeds and shows empty video slots with headings (no crashes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/valentineRemoteProgress.ts",
          "operation": "modify",
          "description": "Improve encoding/decoding and restore logic so the three video slots always reconstruct deterministically from the snapshot payload, and prefer blob-storage retrieval patterns (e.g., using ExternalBlob.getDirectURL when appropriate) while ensuring restored previews are playable in a fresh browser profile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden the remote-first restore path for saveId-based links (and global-latest fallback) so restore always sets landing/final/messages + 3 slots without crashes, and ensures restored URLs are derived from remote snapshot data rather than relying on prior-session state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/VideosPage.tsx",
          "operation": "modify",
          "description": "Update video slot handling to safely manage and clean up only local object URLs while leaving remotely-restored preview URLs intact, ensuring the three-slot UI remains stable for both empty and restored states. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Add frontend safeguards and actionable English error messages for oversized video payloads and backend connectivity/storage failures so users get specific guidance instead of generic \"save failed\".",
      "acceptanceCriteria": [
        "When a user attempts to save videos larger than the configured limits, Save is blocked and the UI shows a specific English error (not a generic \"save failed\").",
        "When the backend is unreachable or the actor is null, the UI shows \"Backend connection not available. Please refresh and try again.\" (or equivalent existing message) and does not lose in-memory edits.",
        "When backend storage/upload fails for blob payloads, the UI surfaces a friendly English error message that helps the user retry or reduce video size."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/valentineRemoteProgress.ts",
          "operation": "modify",
          "description": "Expand error normalization to map common failure modes (null actor, network issues, blob-storage upload/persistence failures, size/limit violations, and backend traps) into actionable English messages compatible with the existing UI error display. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the Save flow preserves in-memory edits on failures, surfaces specific normalized errors (including the required backend-connection message), and consistently blocks Save on preflight size validation failures without attempting remote calls. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/SaveProgressButton.tsx",
          "operation": "modify",
          "description": "Refine the user-facing save error presentation so it consistently displays the normalized actionable English message (including connectivity and oversize guidance) without regressing the existing save/share UX. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Add a concise repo-local technical specification describing the remote video save architecture, API surface expectations, error handling, security model, and a cross-user restore test plan.",
      "acceptanceCriteria": [
        "A markdown technical spec document exists in the repo and includes: (1) problem description of the save failure, (2) architecture overview of snapshot + blob persistence, (3) list of backend methods and expected inputs/outputs, (4) error handling and common failure modes, (5) security/auth rules for reads vs writes, and (6) an implementation and testing checklist that a developer can follow.",
        "All user-facing strings in the spec (examples/error messages) are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/REMOTE_VIDEO_SAVE_SPEC.md",
          "operation": "create",
          "description": "Write the markdown technical specification covering the remote-save client (`frontend/src/lib/valentineRemoteProgress.ts`), the snapshot actor expectations (method names and high-level inputs/outputs), blob persistence via the blob-storage ExternalBlob concept, error handling guidance (English strings), security/auth expectations (Internet Identity + write capability), and a step-by-step cross-user restore test plan. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}